# Задача № 8

# count = int(input('Введите кол-во рядов елки: '))
# for i in range(1, count + 1):
#     a = " " * (count - i)
#     b = "*" * (2 * i - 1)
#     print(a + b)

# #  Задача № 9
#
# for i in range(1, 10):
#     for j in range(1, 10):
#         print(i * j, end=' ')
#     print()

# Задача № 2

# a = int(input('Введите длину первой стороны: '))
# b = int(input('Введите длину второй стороны: '))
# c = int(input('Введите длину третьей стороны: '))
#
# num1 = a + b
# num2 = b + c
# num3 = a + c
#
# if (num1 < c or num2 < a or num3 < b):
#     print('Такого треугольника не существует!')
# else:
#     if (a == b and b == c and a == c):
#         print("Треугольник равносторонний")
#     elif (a == b or b == c or a == c):
#         print("Треугольник равнобедренный ")
#     else:
#         print("Треугольник разносторонний  ")




